export const prefectures = [
  { id: 0, value: '北海道', label: '北海道', districts: [
    { label: '北海道1区', value: '札幌市中央区、札幌市北区、札幌市南区、札幌市西区' },
    { label: '北海道2区', value: '札幌市北区、札幌市東区' },
    { label: '北海道3区', value: '札幌市白石区、札幌市豊平区、札幌市清田区' },
    { label: '北海道4区', value: '札幌市西区、札幌市手稲区、小樽市、石狩市、島牧村、寿都町、黒松内町、蘭越町、ニセコ町、真狩村、留寿都村、喜茂別町、京極町、俱知安町、共和町、岩内町、泊村、神恵内村、積丹町、古平町、仁木町、余市町、赤井川村' },
    { label: '北海道5区', value: '札幌市白石区、札幌市厚別区、江別市、千歳市、恵庭市、北広島市、当別町、新篠津村' },
    { label: '北海道6区', value: '旭川市、士別市、名寄市、富良野市、鹿追町、東神楽町、当麻町、比布町、愛別町、上川町、東川町、美瑛町、上富良野町、中富良野町、南富良野町、占冠村、和寒町、剣淵町、下川町、美深町、音威子府村、中川町、幌加内町' },
    { label: '北海道7区', value: '釧路市、根室市、釧路町、厚岸町、浜中町、標茶町、弟子屈町、鶴居村、白糠町、別海町、中標津町、標津町、羅臼町' },
    { label: '北海道8区', value: '函館市、北斗市、松前町、福島町、知内町、木古内町、七飯町、鹿部町、森町、八雲町、長万部町、江差町、上ノ国町、厚沢部町、乙部町、奥尻町、今金町、せたな町' },
    { label: '北海道9区', value: '室蘭市、苫小牧市、登別市、伊達市、豊浦町、壮瞥町、白老町、厚真町、洞爺湖町、安平町、むかわ町、日高町、平取町、新冠町、浦河町、様似町、えりも町、新ひだか町' },
    { label: '北海道10区', value: '夕張市、岩見沢市、留萌市、美唄市、芦別市、赤平市、三笠市、滝川市、砂川市、歌志内市、深川市、南陽町、奈井江町、上砂川町、由仁町、長沼町、栗山町、月形町、浦臼町、新十津川町、妹背牛町、秩父別町、雨竜町、北竜町、沼田町、幌延町、小平町、苫前町、羽幌町、初山別村、遠別町、天塩町' },
    { label: '北海道11区', value: '帯広市、音更町、士幌町、上士幌町、鹿追町、新得町、清水町、芽室町、中札内村、更別村、大樹町、広尾町、幕別町、池田町、豊頃町、本別町、足寄町、陸別町、浦幌町' },
    { label: '北海道12区', value: '北見市、網走市、稚内市、紋別市、猿払村、浜頓別町、中頓別町、枝幸町、豊富町、礼文町、利尻町、利尻富士町、幌延町、大空町、美幌町、津別町、斜里町、清里町、小清水町、訓子府町、置戸町、佐呂間町、遠軽町、湧別町、滝上町、興部町、西興部村、雄武町' }
  ] },
  { id: 1, value: '青森', label: '青森', districts: [
    { label: '青森1区', value: '青森市、むつ市、平内町、今別町、蓬田村、外ヶ浜町、野辺地町、横浜町、六ヶ所村、大間町、東通村、風間浦村、佐井村' },
    { label: '青森2区', value: '八戸市、十和田市、三沢市、七戸町、六戸町、東北町、おいらせ町、五戸町、田子町、南部町、階上町、新郷村' },
    { label: '青森3区', value: '弘前市、黒石市、五所川原市、つがる市、平川市、鰺ヶ沢町、深浦町、西目屋村、藤崎町、大鰐町、田舎館村、板柳町、鶴田町、中泊町' }
  ] },
  { id: 2, value: '岩手', label: '岩手', districts: [
    { label: '岩手1区', value: '盛岡市、紫波町、矢巾町' },
    { label: '岩手2区', value: '宮古市、大船渡市、久慈市、遠野市、陸前高田市、釜石市、二戸市、八幡平市、滝沢市、岩手町、葛巻町、岩泉町、住田町、山田町、普代村、田野畑村、野田村、九戸村、洋野町、一戸町' },
    { label: '岩手3区', value: '花巻市、北上市、一関市、奥州市、西和賀町、金ケ崎町、平泉町' }
  ] },
  { id: 3, value: '宮城', label: '宮城', districts: [
    { label: '宮城1区', value: '仙台市青葉区、仙台市太白区' },
    { label: '宮城2区', value: '仙台市宮城野区、仙台市若林区、仙台市泉区' },
    { label: '宮城3区', value: '名取市、角田市、岩沼市、蔵王町、七ヶ宿町、大河原町、村田町、柴田町、川崎町、丸森町、亘理町、山元町' },
    { label: '宮城4区', value: '石巻市、登米市、栗原市、東松島市、大崎市（鹿島台、小野、松山、三本木、田尻を除く）、松島町、七ヶ浜町、利府町、大和町、大郷町、大衡村、女川町' },
    { label: '宮城5区', value: '気仙沼市、登米市、栗原市、大崎市（鹿島台、小野、松山、三本木、田尻）、加美町、色麻町、美里町、南三陸町' }
  ] },
  { id: 4, value: '秋田', label: '秋田', districts: [
    { label: '秋田1区', value: '秋田市' },
    { label: '秋田2区', value: '能代市、大館市、男鹿市、鹿角市、湯上市、北秋田市、小坂町、上小阿仁村、藤里町、三種町、八峰町、五城目町、八郎潟町、井川町、大潟村' },
    { label: '秋田3区', value: '横手市、湯沢市、由利本荘市、大仙市、にかほ市、仙北市、美郷町、羽後町、東成瀬村' }
  ] },
  { id: 5, value: '山形', label: '山形', districts: [
    { label: '山形1区', value: '山形市、天童市、山辺町、中山町' },
    { label: '山形2区', value: '米沢市、寒河江市、村山市、東根市、尾花沢市、南陽市、河北町、西川町、大江町、大石田町、高畠町、川西町、小国町、白鷹町、飯豊町' },
    { label: '山形3区', value: '鶴岡市、酒田市、長井市、金山町、最上町、舟形町、真室川町、大蔵村、鮭川村、戸沢村、三川町、庄内町、遊佐町' }
  ] },
  { id: 6, value: '福島', label: '福島', districts: [
    { label: '福島1区', value: '福島市、二本松市、伊達市、本宮市、桑折町、国見町、川俣町、大玉村' },
    { label: '福島2区', value: '郡山市、須賀川市、田村市、天栄村、石川町、玉川村、平田村、浅川町、古殿町、三春町、小野町' },
    { label: '福島3区', value: '会津若松市、白河市、喜多方市、下郷町、檜枝岐村、只見町、南会津町、北塩原村、西会津町、磐梯町、猪苗代町、会津坂下町、湯川村、柳津町、三島町、金山町、昭和村、会津美里町、西郷村、泉崎村、中島村、矢吹町、棚倉町、矢祭町、塙町、鮫川村' },
    { label: '福島4区', value: 'いわき市、相馬市、南相馬市、広野町、楢葉町、富岡町、川内村、大熊町、双葉町、浪江町、葛尾村、新地町、飯舘村' }
  ] },
  { id: 7, value: '茨城', label: '茨城', districts: [
    { label: '茨城1区', value: '水戸市、笠間市、筑西市、桜川市、城里町' },
    { label: '茨城2区', value: '鹿嶋市、潮来市、神栖市、行方市、鉾田市、小美玉市、茨城町、大洗町' },
    { label: '茨城3区', value: '龍ケ崎市、取手市、牛久市、守谷市、稲敷市、美浦村、阿見町、河内町、利根町' },
    { label: '茨城4区', value: '常陸太田市、ひたちなか市、常陸大宮市、那珂市、大子町' },
    { label: '茨城5区', value: '日立市、高萩市、北茨城市、東海村' },
    { label: '茨城6区', value: '土浦市、石岡市、つくば市、かすみがうら市、つくばみらい市' },
    { label: '茨城7区', value: '古河市、結城市、下妻市、常総市、坂東市、八千代町、五霞町、境町' }
  ] },
  { id: 8, value: '栃木', label: '栃木', districts: [
    { label: '栃木1区', value: '宇都宮市、上三川町' },
    { label: '栃木2区', value: '宇都宮市、鹿沼市、日光市、さくら市、塩谷町、高根沢町' },
    { label: '栃木3区', value: '大田原市、矢板市、那須塩原市、那須烏山市、那須町、那珂川町' },
    { label: '栃木4区', value: '小山市、真岡市、下野市、益子町、茂木町、市貝町、芳賀町、壬生町、野木町' },
    { label: '栃木5区', value: '足利市、栃木市、佐野市' }
  ] },
  { id: 9, value: '群馬', label: '群馬', districts: [
    { label: '群馬1区', value: '前橋市、沼田市、片品村、川場村、昭和村、みなかみ町' },
    { label: '群馬2区', value: '桐生市、伊勢崎市、みどり市、玉村町' },
    { label: '群馬3区', value: '太田市、館林市、板倉町、明和町、千代田町、大泉町、邑楽町' },
    { label: '群馬4区', value: '高崎市、藤岡市、上野村、神流町' },
    { label: '群馬5区', value: '高崎市、渋川市、富岡市、安中市、榛東村、吉岡町、下仁田町、南牧村、甘楽町、中之条町、長野原町、嬬恋村、草津町、高山村、東吾妻町' }
  ] },
  { id: 10, value: '埼玉', label: '埼玉', districts: [
    { label: '埼玉1区', value: 'さいたま市見沼区、さいたま市浦和区、さいたま市緑区' },
    { label: '埼玉2区', value: '川口市' },
    { label: '埼玉3区', value: '川口市、越谷市' },
    { label: '埼玉4区', value: '朝霞市、志木市、和光市、新座市' },
    { label: '埼玉5区', value: 'さいたま市西区、さいたま市北区、さいたま市大宮区、さいたま市中央区' },
    { label: '埼玉6区', value: '鴻巣市、上尾市、桶川市、北本市' },
    { label: '埼玉7区', value: '川越市、富士見市' },
    { label: '埼玉8区', value: '所沢市、ふじみ野市、三芳町' },
    { label: '埼玉9区', value: '飯能市、狭山市、入間市、日高市、毛呂山町、越生町' },
    { label: '埼玉10区', value: '東松山市、坂戸市、鶴ヶ島市、滑川町、嵐山町、小川町、川島町、吉見町、鳩山町、ときがわ町' },
    { label: '埼玉11区', value: '秩父市、本庄市、深谷市、横瀬町、皆野町、長瀞町、小鹿野町、東秩父村、美里町、神川町、上里町、寄居町' },
    { label: '埼玉12区', value: '熊谷市、行田市、加須市、羽生市' },
    { label: '埼玉13区', value: '久喜市、蓮田市、幸手市、白岡市、伊奈町、宮代町、杉戸町' },
    { label: '埼玉14区', value: '草加市、八潮市、三郷市' },
    { label: '埼玉15区', value: 'さいたま市桜区、さいたま市南区、蕨市、戸田市' },
    { label: '埼玉16区', value: 'さいたま市岩槻区、春日部市、吉川市、松伏町' }
  ] },
  { id: 11, value: '千葉', label: '千葉', districts: [
    { label: '千葉1区', value: '千葉市中央区、千葉市稲毛区、千葉市美浜区' },
    { label: '千葉2区', value: '千葉市花見川区、八千代市' },
    { label: '千葉3区', value: '千葉市緑区、市原市' },
    { label: '千葉4区', value: '市川市、船橋市' },
    { label: '千葉5区', value: '市川市、浦安市' },
    { label: '千葉6区', value: '松戸市' },
    { label: '千葉7区', value: '野田市、流山市' },
    { label: '千葉8区', value: '柏市' },
    { label: '千葉9区', value: '千葉市若葉区、佐倉市、四街道市、八街市' },
    { label: '千葉10区', value: '銚子市、成田市、旭市、匝瑳市、香取市、神崎町、多古町、東庄町' },
    { label: '千葉11区', value: '茂原市、東金市、勝浦市、山武市、いすみ市、大網白里市、九十九里町、芝山町、横芝光町、一宮町、睦沢町、長生村、白子町、長柄町、長南町、大多喜町、御宿町' },
    { label: '千葉12区', value: '館山市、木更津市、鴨川市、君津市、富津市、袖ケ浦市、南房総市、鋸南町' },
    { label: '千葉13区', value: '我孫子市、鎌ケ谷市、印西市、白井市、富里市、酒々井町、栄町' },
    { label: '千葉14区', value: '船橋市、習志野市' }
  ] },
  { id: 12, value: '東京', label: '東京', districts: [
    { label: '東京1区', value: '千代田区、新宿区' },
    { label: '東京2区', value: '中央区、台東区' },
    { label: '東京3区', value: '品川区、大島町、利島村、新島村、神津島村、三宅村、御蔵島村、八丈町、青ヶ島村、小笠原村' },
    { label: '東京4区', value: '大田区' },
    { label: '東京5区', value: '世田谷区' },
    { label: '東京6区', value: '世田谷区' },
    { label: '東京7区', value: '港区、渋谷区' },
    { label: '東京8区', value: '杉並区' },
    { label: '東京9区', value: '練馬区' },
    { label: '東京10区', value: '文京区、豊島区' },
    { label: '東京11区', value: '板橋区' },
    { label: '東京12区', value: '北区、板橋区' },
    { label: '東京13区', value: '足立区' },
    { label: '東京14区', value: '墨田区、江戸川区' },
    { label: '東京15区', value: '江東区' },
    { label: '東京16区', value: '江戸川区' },
    { label: '東京17区', value: '葛飾区' },
    { label: '東京18区', value: '武蔵野市、小金井市、西東京市' },
    { label: '東京19区', value: '小平市、国分寺市、国立市' },
    { label: '東京20区', value: '東村山市、東大和市、清瀬市、東久留米市、武蔵村山市' },
    { label: '東京21区', value: '八王子市、立川市、日野市' },
    { label: '東京22区', value: '三鷹市、調布市、狛江市' },
    { label: '東京23区', value: '町田市' },
    { label: '東京24区', value: '八王子市' },
    { label: '東京25区', value: '青梅市、昭島市、福生市、羽村市、あきる野市、瑞穂町、日の出町、檜原村、奥多摩町' },
    { label: '東京26区', value: '目黒区、大田区' },
    { label: '東京27区', value: '中野区、杉並区' },
    { label: '東京28区', value: '練馬区' },
    { label: '東京29区', value: '荒川区、足立区' },
    { label: '東京30区', value: '府中市、多摩市、稲城市' }
  ] },
  { id: 13, value: '神奈川', label: '神奈川', districts: [
    { label: '神奈川1区', value: '横浜市中区、横浜市磯子区、横浜市金沢区' },
    { label: '神奈川2区', value: '横浜市西区、横浜市南区、横浜市港南区' },
    { label: '神奈川3区', value: '横浜市鶴見区、横浜市神奈川区' },
    { label: '神奈川4区', value: '横浜市栄区、鎌倉市、逗子市、葉山町' },
    { label: '神奈川5区', value: '横浜市戸塚区、横浜市泉区' },
    { label: '神奈川6区', value: '横浜市保土ケ谷区、横浜市旭区' },
    { label: '神奈川7区', value: '横浜市港北区' },
    { label: '神奈川8区', value: '横浜市緑区、横浜市青葉区' },
    { label: '神奈川9区', value: '川崎市多摩区、川崎市麻生区' },
    { label: '神奈川10区', value: '川崎市川崎区、川崎市幸区' },
    { label: '神奈川11区', value: '横須賀市、三浦市' },
    { label: '神奈川12区', value: '藤沢市、寒川町' },
    { label: '神奈川13区', value: '横浜市瀬谷区、大和市、綾瀬市' },
    { label: '神奈川14区', value: '相模原市緑区、相模原市中央区、愛川町、清川村' },
    { label: '神奈川15区', value: '平塚市、茅ヶ崎市、大磯町' },
    { label: '神奈川16区', value: '厚木市、伊勢原市、海老名市' },
    { label: '神奈川17区', value: '小田原市、秦野市、南足柄市、二宮町、中井町、大井町、松田町、山北町、開成町、箱根町、真鶴町、湯河原町' },
    { label: '神奈川18区', value: '川崎市中原区、川崎市高津区' },
    { label: '神奈川19区', value: '横浜市都筑区、川崎市宮前区' },
    { label: '神奈川20区', value: '相模原市南区、座間市' }
  ] },
  { id: 14, value: '新潟', label: '新潟', districts: [
    { label: '新潟1区', value: '新潟市東区、新潟市中央区、新潟市江南区、佐渡市' },
    { label: '新潟2区', value: '新潟市南区、新潟市西区、新潟市西蒲区、三条市、加茂市、燕市、弥彦村、田上町' },
    { label: '新潟3区', value: '新潟市北区、新潟市秋葉区、新発田市、村上市、五泉市、阿賀野市、胎内市、聖籠町、阿賀町、関川村、粟島浦村' },
    { label: '新潟4区', value: '長岡市、柏崎市、小千谷市、見附市、出雲崎町、刈羽村' },
    { label: '新潟5区', value: '十日町市、糸魚川市、妙高市、上越市、魚沼市、南魚沼市、湯沢町、津南町' }
  ] },
  { id: 15, value: '富山', label: '富山', districts: [
    { label: '富山1区', value: '富山市' },
    { label: '富山2区', value: '富山市、魚津市、滑川市、黒部市、舟橋村、上市町、立山町、入善町、朝日町' },
    { label: '富山3区', value: '高岡市、氷見市、砺波市、小矢部市、南砺市、射水市' }
  ] },
  { id: 16, value: '石川', label: '石川', districts: [
    { label: '石川1区', value: '金沢市' },
    { label: '石川2区', value: '小松市、加賀市、白山市、能美市、野々市市、川北町' },
    { label: '石川3区', value: '七尾市、輪島市、珠洲市、羽咋市、かほく市、津幡町、内灘町、志賀町、宝達志水町、中能登町、穴水町、能登町' }
  ] },
  { id: 17, value: '福井', label: '福井', districts: [
    { label: '福井1区', value: '福井市、大野市、勝山市、坂井市、あわら市、永平寺町' },
    { label: '福井2区', value: '敦賀市、小浜市、鯖江市、越前市、池田町、南越前町、越前町、美浜町、高浜町、おおい町、若狭町' }
  ] },
  { id: 18, value: '山梨', label: '山梨', districts: [
    { label: '山梨1区', value: '甲府市、韮崎市、南アルプス市、北杜市、甲斐市、中央市、市川三郷町、早川町、身延町、南部町、富士川町、昭和町' },
    { label: '山梨2区', value: '富士吉田市、都留市、山梨市、大月市、笛吹市、上野原市、甲州市、道志村、西桂町、忍野村、山中湖村、鳴沢村、富士河口湖町、小菅村、丹波山村' }
  ] },
  { id: 19, value: '長野', label: '長野', districts: [
    { label: '長野1区', value: '長野市、須坂市、中野市、飯山市、小布施町、高山村、山ノ内町、木島平村、野沢温泉村、栄村' },
    { label: '長野2区', value: '長野市、松本市、大町市、安曇野市、麻績村、生坂村、山形村、朝日村、筑北村、池田町、松川村、白馬村、小谷村、信濃町、飯綱町、小川村' },
    { label: '長野3区', value: '上田市、小諸市、佐久市、千曲市、東御市、小海町、川上村、南牧村、南相木村、北相木村、佐久穂町、軽井沢町、御代田町、立科町、青木村、長和町、坂城町' },
    { label: '長野4区', value: '岡谷市、諏訪市、茅野市、塩尻市、下諏訪町、富士見町、原村、上松町、南木曽町、木祖村、王滝村、大桑村、木曽町' },
    { label: '長野5区', value: '飯田市、伊那市、駒ヶ根市、辰野町、箕輪町、飯島町、南箕輪村、中川村、宮田村、松川町、高森町、阿南町、阿智村、平谷村、根羽村、下條村、売木村、天龍村、泰阜村、高森村、豊丘村、大鹿村' }
  ] },
  { id: 20, value: '岐阜', label: '岐阜', districts: [
    { label: '岐阜1区', value: '岐阜市' },
    { label: '岐阜2区', value: '大垣市、海津市、養老町、垂井町、関ケ原町、神戸町、輪之内町、安八町、揖斐川町、大野町、池田町' },
    { label: '岐阜3区', value: '関市、美濃市、羽島市、各務原市、山県市、瑞穂市、本巣市、岐南町、笠松町、北方町' },
    { label: '岐阜4区', value: '高山市、美濃加茂市、可児市、飛騨市、郡上市、下呂市、坂祝町、富加町、川辺町、七宗町、八百津町、白川町、東白川村、御嵩町、白川村' },
    { label: '岐阜5区', value: '多治見市、中津川市、瑞浪市、恵那市、土岐市' }
  ] },
  { id: 21, value: '静岡', label: '静岡', districts: [
    { label: '静岡1区', value: '静岡市葵区、静岡市駿河区' },
    { label: '静岡2区', value: '島田市、焼津市、藤枝市、牧之原市、吉田町、川根本町' },
    { label: '静岡3区', value: '磐田市、袋井市、菊川市、掛川市、御前崎市、森町' },
    { label: '静岡4区', value: '静岡市清水区、富士宮市、富士市' },
    { label: '静岡5区', value: '三島市、富士市、御殿場市、裾野市、函南町、小山町' },
    { label: '静岡6区', value: '沼津市、熱海市、伊東市、下田市、伊豆市、伊豆の国市、東伊豆町、河津町、南伊豆町、松崎町、西伊豆町、清水町、長泉町' },
    { label: '静岡7区', value: '浜松市中央区、浜松市浜名区、浜松市天竜区、湖西市' },
    { label: '静岡8区', value: '浜松市中央区' }
  ] },
  { id: 22, value: '愛知', label: '愛知', districts: [
    { label: '愛知1区', value: '名古屋市東区、名古屋市北区、名古屋市西区、名古屋市中区' },
    { label: '愛知2区', value: '名古屋市千種区、名古屋市守山区、名古屋市名東区' },
    { label: '愛知3区', value: '名古屋市昭和区、名古屋市緑区、名古屋市天白区' },
    { label: '愛知4区', value: '名古屋市瑞穂区、名古屋市熱田区、名古屋市港区、名古屋市南区' },
    { label: '愛知5区', value: '名古屋市中村区、名古屋市中川区、清須市' },
    { label: '愛知6区', value: '瀬戸市、春日井市' },
    { label: '愛知7区', value: '大府市、尾張旭市、豊明市、日進市、長久手市、東郷町' },
    { label: '愛知8区', value: '半田市、常滑市、東海市、知多市、阿久比町、東浦町、南知多町、美浜町、武豊町' },
    { label: '愛知9区', value: '津島市、稲沢市、愛西市、弥富市、あま市、大治町、蟹江町、飛島村' },
    { label: '愛知10区', value: '一宮市、岩倉市' },
    { label: '愛知11区', value: '豊田市、みよし市' },
    { label: '愛知12区', value: '岡崎市、西尾市' },
    { label: '愛知13区', value: '碧南市、刈谷市、安城市、知立市、高浜市' },
    { label: '愛知14区', value: '豊川市、蒲郡市、新城市、幸田町、設楽町、東栄町、豊根村' },
    { label: '愛知15区', value: '豊橋市、田原市' },
    { label: '愛知16区', value: '犬山市、江南市、小牧市、北名古屋市、豊山町、大口町、扶桑町' }
  ] },
  { id: 23, value: '三重', label: '三重', districts: [
    { label: '三重1区', value: '津市、松阪市' },
    { label: '三重2区', value: '四日市市、鈴鹿市、名張市、亀山市、伊賀市' },
    { label: '三重3区', value: '四日市市、桑名市、いなべ市、木曽岬町、東員町、菰野町、朝日町、川越町' },
    { label: '三重4区', value: '伊勢市、尾鷲市、鳥羽市、熊野市、志摩市、多気町、明和町、大台町、玉城町、度会町、大紀町、南伊勢町、紀北町、御浜町、紀宝町' }
  ] },
  { id: 24, value: '滋賀', label: '滋賀', districts: [
    { label: '滋賀1区', value: '大津市、高島市' },
    { label: '滋賀2区', value: '彦根市、長浜市、近江八幡市、東近江市、米原市、日野町、竜王町、愛荘町、豊郷町、甲良町、多賀町' },
    { label: '滋賀3区', value: '草津市、守山市、栗東市、甲賀市、野洲市、湖南市' }
  ] },
  { id: 25, value: '京都', label: '京都', districts: [
    { label: '京都1区', value: '京都市北区、京都市上京区、京都市中京区、京都市下京区、京都市南区' },
    { label: '京都2区', value: '京都市左京区、京都市東山区、京都市山科区' },
    { label: '京都3区', value: '京都市伏見区、向日市、長岡京市、大山崎町' },
    { label: '京都4区', value: '京都市右京区、京都市西京区、亀岡市、南丹市、京丹波町' },
    { label: '京都5区', value: '福知山市、舞鶴市、綾部市、宮津市、京丹後市、伊根町、与謝野町' },
    { label: '京都6区', value: '宇治市、城陽市、八幡市、京田辺市、木津川市、久御山町、井手町、宇治田原町、笠置町、和束町、精華町、南山城村' }
  ] },
  { id: 26, value: '大阪', label: '大阪', districts: [
    { label: '大阪1区', value: '大阪市中央区、大阪市西区、大阪市港区、大阪市天王寺区、大阪市浪速区、大阪市東成区' },
    { label: '大阪2区', value: '大阪市生野区、大阪市阿倍野区、大阪市東住吉区、大阪市平野区' },
    { label: '大阪3区', value: '大阪市大正区、大阪市住之江区、大阪市住吉区、大阪市西成区' },
    { label: '大阪4区', value: '大阪市北区、大阪市都島区、大阪市福島区、大阪市城東区' },
    { label: '大阪5区', value: '大阪市此花区、大阪市西淀川区、大阪市淀川区、大阪市東淀川区' },
    { label: '大阪6区', value: '大阪市旭区、大阪市鶴見区、守口市、門真市' },
    { label: '大阪7区', value: '吹田市、摂津市' },
    { label: '大阪8区', value: '豊中市、池田市' },
    { label: '大阪9区', value: '茨木市、箕面市、豊能町、能勢町' },
    { label: '大阪10区', value: '高槻市、島本町' },
    { label: '大阪11区', value: '枚方市、交野市' },
    { label: '大阪12区', value: '寝屋川市、大東市、四條畷市' },
    { label: '大阪13区', value: '東大阪市' },
    { label: '大阪14区', value: '八尾市、柏原市、羽曳野市、藤井寺市' },
    { label: '大阪15区', value: '堺市美原区、富田林市、河内長野市、松原市、大阪狭山市、太子町、河南町、千早赤阪村' },
    { label: '大阪16区', value: '堺市堺区、堺市東区、堺市北区' },
    { label: '大阪17区', value: '堺市中区、堺市西区、堺市南区' },
    { label: '大阪18区', value: '岸和田市、泉大津市、和泉市、高石市、忠岡町' },
    { label: '大阪19区', value: '貝塚市、泉佐野市、泉南市、阪南市、熊取町、田尻町、岬町' }
  ] },
  { id: 27, value: '兵庫', label: '兵庫', districts: [
    { label: '兵庫1区', value: '神戸市東灘区、神戸市灘区、神戸市中央区' },
    { label: '兵庫2区', value: '神戸市兵庫区、神戸市北区、神戸市長田区、西宮市' },
    { label: '兵庫3区', value: '神戸市須磨区、神戸市垂水区' },
    { label: '兵庫4区', value: '神戸市西区、西脇市、三木市、小野市、加西市、加東市、多可町' },
    { label: '兵庫5区', value: '豊岡市、三田市、養父市、朝来市、香美町、川西市、丹波篠山市、丹波市、猪名川町、新温泉町' },
    { label: '兵庫6区', value: '伊丹市、宝塚市、川西市' },
    { label: '兵庫7区', value: '西宮市、芦屋市' },
    { label: '兵庫8区', value: '尼崎市' },
    { label: '兵庫9区', value: '明石市、洲本市、南あわじ市、淡路市' },
    { label: '兵庫10区', value: '加古川市、高砂市、稲美町、播磨町' },
    { label: '兵庫11区', value: '姫路市' },
    { label: '兵庫12区', value: '姫路市、相生市、赤穂市、宍粟市、たつの市、市川町、福崎町、神河町、太子町、上郡町、佐用町' }
  ] },
  { id: 28, value: '奈良', label: '奈良', districts: [
    { label: '奈良1区', value: '奈良市、生駒市' },
    { label: '奈良2区', value: '奈良市、大和郡山市、天理市、香芝市、山添村、平群町、三郷町、斑鳩町、安堵町、川西町、三宅町、田原本町、上牧町、王寺町、広陵町、河合町' },
    { label: '奈良3区', value: '大和高田市、橿原市、桜井市、五條市、御所市、葛城市、宇陀市、曽爾村、御杖村、高取町、明日香村、吉野町、大淀町、下市町、黒滝村、天川村、野迫川村、十津川村、下北山村、上北山村、川上村、東吉野村' }
  ] },
  { id: 29, value: '和歌山', label: '和歌山', districts: [
    { label: '和歌山1区', value: '和歌山市、紀の川市、岩出市' },
    { label: '和歌山2区', value: '海南市、橋本市、有田市、御坊市、田辺市、新宮市、紀美野町、かつらぎ町、九度山町、高野町、湯浅町、広川町、有田川町、美浜町、日高町、由良町、印南町、みなべ町、日高川町、白浜町、上富田町、すさみ町、那智勝浦町、大地町、古座川町、北山村、串本町' }
  ] },
  { id: 30, value: '鳥取', label: '鳥取', districts: [
    { label: '鳥取1区', value: '鳥取市、倉吉市、岩美町、若桜町、智頭町、八頭町、三朝町' },
    { label: '鳥取2区', value: '米子市、境港市、湯梨浜町、琴浦町、北栄町、日吉津村、大山町、南部町、伯耆町、日南町、日野町、江府町' }
  ] },
  { id: 31, value: '島根', label: '島根', districts: [
    { label: '島根1区', value: '松江市、安来市、雲南市、奥出雲町、飯南町、海士町、西ノ島町、知夫村、隠岐の島町' },
    { label: '島根2区', value: '浜田市、出雲市、益田市、大田市、江津市、川本町、美郷町、邑智町、津和野町、吉賀町' }
  ] },
  { id: 32, value: '岡山', label: '岡山', districts: [
    { label: '岡山1区', value: '岡山市北区、備前市、赤磐市、和気町、吉備中央町' },
    { label: '岡山2区', value: '岡山市中区、岡山市東区、岡山市南区、玉野市、瀬戸内市' },
    { label: '岡山3区', value: '津山市、笠岡市、井原市、総社市、高梁市、新見市、真庭市、美作市、浅口市、里庄町、矢掛町、新庄村、鏡野町、勝央町、奈義町、西粟倉村、久米南町、美咲町' },
    { label: '岡山4区', value: '倉敷市、早島町' }
  ] },
  { id: 33, value: '広島', label: '広島', districts: [
    { label: '広島1区', value: '広島市中区、広島市東区、広島市南区、府中町、海田町、坂町' },
    { label: '広島2区', value: '広島市西区、広島市佐伯区、大竹市、廿日市市' },
    { label: '広島3区', value: '広島市安佐南区、広島市安佐北区、広島市安芸区、安芸高田市、安芸太田町、北広島町' },
    { label: '広島4区', value: '呉市、竹原市、東広島市、江田島市、熊野町、大崎上島町' },
    { label: '広島5区', value: '三原市、尾道市、府中市、三次市、庄原市、世羅町、神石高原町' },
    { label: '広島6区', value: '福山市' }
  ] },
  { id: 34, value: '山口', label: '山口', districts: [
    { label: '山口1区', value: '宇部市、山口市、防府市' },
    { label: '山口2区', value: '下松市、岩国市、光市、柳井市、周南市、周防大島町、和木町、上関町、田布施町、平生町' },
    { label: '山口3区', value: '下関市、萩市、長門市、美祢市、山陽小野田市、阿武町' }
  ] },
  { id: 35, value: '徳島', label: '徳島', districts: [
    { label: '徳島1区', value: '徳島市、小松島市、阿南市、勝浦町、上勝町、佐那河内村、石井町、神山町、那賀町、牟岐町、美波町、海陽町' },
    { label: '徳島2区', value: '鳴門市、吉野川市、阿波市、美馬市、三好市、松茂町、北島町、藍住町、板野町、上板町、つるぎ町、東みよし町' }
  ] },
  { id: 36, value: '香川', label: '香川', districts: [
    { label: '香川1区', value: '高松市、土庄町、小豆島町、直島町' },
    { label: '香川2区', value: '高松市、丸亀市、坂出市、さぬき市、東かがわ市、三木町、宇多津町、綾川町' },
    { label: '香川3区', value: '丸亀市、善通寺市、観音寺市、三豊市、琴平町、多度津町、まんのう町' }
  ] },
  { id: 37, value: '愛媛', label: '愛媛', districts: [
    { label: '愛媛1区', value: '松山市' },
    { label: '愛媛2区', value: '今治市、新居浜市、西条市、四国中央市、上島町' },
    { label: '愛媛3区', value: '宇和島市、八幡浜市、大洲市、伊予市、西予市、東温市、久万高原町、松前町、砥部町、内子町、伊方町、松野町、鬼北町、愛南町' }
  ] },
  { id: 38, value: '高知', label: '高知', districts: [
    { label: '高知1区', value: '高知市、室戸市、安芸市、南国市、香南市、香美市、東洋町、奈半利町、田野町、安田町、北川村、馬路村、芸西村、本山町、大豊町、土佐町、大川村' },
    { label: '高知2区', value: '高知市、土佐市、須崎市、宿毛市、土佐清水市、四万十市、いの町、仁淀川町、中土佐町、佐川町、越知町、檮原町、日高村、津野町、四万十町、大月町、三原村、黒潮町' }
  ] },
  { id: 39, value: '福岡', label: '福岡', districts: [
    { label: '福岡1区', value: '福岡市東区、福岡市博多区' },
    { label: '福岡2区', value: '福岡市中央区、福岡市南区、福岡市城南区' },
    { label: '福岡3区', value: '福岡市城南区、福岡市早良区、福岡市西区、糸島市' },
    { label: '福岡4区', value: '福岡市東区、宗像市、古賀市、福津市、宇美町、篠栗町、志免町、須恵町、新宮町、久山町、粕屋町' },
    { label: '福岡5区', value: '福岡市南区、筑紫野市、春日市、大野城市、太宰府市、朝倉市、那珂川市、筑前町、東峰村' },
    { label: '福岡6区', value: '久留米市、大川市、小郡市、うきは市、大刀洗町、大木町' },
    { label: '福岡7区', value: '大牟田市、柳川市、八女市、筑後市、みやま市、広川町' },
    { label: '福岡8区', value: '直方市、飯塚市、中間市、宮若市、嘉麻市、芦屋町、水巻町、岡垣町、遠賀町、小竹町、鞍手町、桂川町' },
    { label: '福岡9区', value: '北九州市若松区、北九州市八幡東区、北九州市八幡西区、北九州市戸畑区' },
    { label: '福岡10区', value: '北九州市門司区、北九州市小倉北区、北九州市小倉南区' },
    { label: '福岡11区', value: '田川市、行橋市、豊前市、香春町、添田町、糸田町、川崎町、大任町、赤村、福智町、苅田町、みやこ町、吉富町、上毛町、築上町' }
  ] },
  { id: 40, value: '佐賀', label: '佐賀', districts: [
    { label: '佐賀1区', value: '佐賀市、鳥栖市、神埼市、吉野ヶ里町、基山町、上峰町、みやき町' },
    { label: '佐賀2区', value: '唐津市、多久市、伊万里市、武雄市、鹿島市、小城市、嬉野市、玄海町、有田町、大町町、江北町、白石町、太良町' }
  ] },
  { id: 41, value: '長崎', label: '長崎', districts: [
    { label: '長崎1区', value: '長崎市' },
    { label: '長崎2区', value: '島原市、諫早市、大村市、対馬市、壱岐市、雲仙市、南島原市、長与町、時津町' },
    { label: '長崎3区', value: '佐世保市、平戸市、松浦市、五島市、西海市、東彼杵町、川棚町、波佐見町、小値賀町、佐々町、新上五島町' }
  ] },
  { id: 42, value: '熊本', label: '熊本', districts: [
    { label: '熊本1区', value: '熊本市中央区、熊本市東区、熊本市北区' },
    { label: '熊本2区', value: '熊本市西区、熊本市南区、荒尾市、玉名市、玉東町、南関町、長洲町、和水町' },
    { label: '熊本3区', value: '山鹿市、菊池市、阿蘇市、合志市、大津町、菊陽町、南小国町、小国町、産山村、高森町、西原村、南阿蘇村、御船町、嘉島町、益城町、甲佐町、山都町' },
    { label: '熊本4区', value: '八代市、人吉市、水俣市、天草市、宇土市、上天草市、宇城市、美里町、氷川町、芦北町、津奈木町、錦町、多良木町、湯前町、水上村、相良村、五木村、山江村、球磨村、あさぎり町、苓北町' }
  ] },
  { id: 43, value: '大分', label: '大分', districts: [
    { label: '大分1区', value: '大分市' },
    { label: '大分2区', value: '大分市、日田市、佐伯市、臼杵市、津久見市、竹田市、豊後大野市、由布市、九重町、玖珠町' },
    { label: '大分3区', value: '別府市、中津市、豊後高田市、杵築市、宇佐市、国東市、姫島村、日出町' }
  ] },
  { id: 44, value: '宮崎', label: '宮崎', districts: [
    { label: '宮崎1区', value: '宮崎市、国富町、綾町' },
    { label: '宮崎2区', value: '延岡市、日向市、西都市、高鍋町、新富町、西米良村、木城町、川南町、都農町、門川町、諸塚村、椎葉村、美郷町、高千穂町、日之影町、五ヶ瀬町' },
    { label: '宮崎3区', value: '都城市、日南市、小林市、串間市、えびの市、三股町、高原町' }
  ] },
  { id: 45, value: '鹿児島', label: '鹿児島', districts: [
    { label: '鹿児島1区', value: '鹿児島市、三島村、十島村' },
    { label: '鹿児島2区', value: '鹿児島市、枕崎市、指宿市、南さつま市、奄美市、南九州市、大和村、宇検村、瀬戸内町、龍郷町、喜界町、徳之島町、天城町、伊仙町、和泊町、知名町、与論町' },
    { label: '鹿児島3区', value: '阿久根市、出水市、薩摩川内市、日置市、いちき串木野市、伊佐市、 姶良市、さつま町、長島町、湧水町' },
    { label: '鹿児島4区', value: '鹿屋市、西之表市、垂水市、曽於市、霧島市、志布志市、大崎町、東串良町、錦江町、南大隅町、肝付町、中種子町、南種子町、屋久島町' }
  ] },
  { id: 46, value: '沖縄', label: '沖縄', districts: [
    { label: '沖縄1区', value: '那覇市、渡嘉敷村、座間味村、粟国村、渡名喜村、南大東村、北大東村、久米島町' },
    { label: '沖縄2区', value: '宜野湾市、浦添市、読谷村、嘉手納町、北谷町、北中城村、中城村、西原町' },
    { label: '沖縄3区', value: '名護市、沖縄市、うるま市、国頭村、大宜味村、東村、今帰仁村、本部町、恩納村、宜野座村、金武町、伊江村、伊平屋村、伊是名村' },
    { label: '沖縄4区', value: '石垣市、糸満市、豊見城市、宮古島市、南城市、与那原町、南風原町、八重瀬町、多良間村、竹富町、与那国町' }
  ] }
]

export const blocks = [
  { id: 1, value: '北海道', label: '北海道', counts: 8 },
  { id: 2, value: '東北', label: '東北', counts: 12 },
  { id: 3, value: '北関東', label: '北関東', counts: 19 },
  { id: 4, value: '東京', label: '東京', counts: 19 },
  { id: 5, value: '南関東', label: '南関東', counts: 23 },
  { id: 6, value: '北陸信越', label: '北陸信越', counts: 10 },
  { id: 7, value: '東海', label: '東海', counts: 21 },
  { id: 8, value: '近畿', label: '近畿', counts: 28 },
  { id: 9, value: '中国', label: '中国', counts: 10 },
  { id: 10, value: '四国', label: '四国', counts: 6 },
  { id: 11, value: '九州', label: '九州', counts: 20 },
]

export type IPrefecture = (typeof prefectures)[number]
export type IDistrict = IPrefecture['districts'][number]

export interface PrefectureWithDistricts {
  prefecture: IPrefecture
  districts: IDistrict[]
}

export function getPrefecturesAndDistrictsByKeyword(keyword: string): PrefectureWithDistricts[] {
  const trimmed = keyword?.trim()
  if (!trimmed) return []

  return prefectures
    .map((prefecture) => {
      const prefMatches =
        prefecture.label.includes(trimmed) || prefecture.value.includes(trimmed)
      const matchingDistricts = prefecture.districts.filter(
        (d) =>
          prefMatches ||
          d.label.includes(trimmed) ||
          d.value.includes(trimmed)
      )
      if (matchingDistricts.length > 0 || prefMatches) {
        return {
          prefecture,
          districts: prefMatches ? prefecture.districts : matchingDistricts,
        }
      }
      return null
    })
    .filter((x): x is PrefectureWithDistricts => x !== null)
}
